# encoding: utf-8
class String
  if RUBY_VERSION < '1.9'
  
    def digit_date
      gsub(/jan(?:uary)?|[яЯ][нН][вВ](?:[аА][рР][яЯьЬ]?)?/i, '01').
      gsub(/feb(?:ruary)?|[фФ][еЕ][вВ](?:[рР][аА][лЛ][яЯьЬ]?)?/i, '02').
      gsub(/mar(?:ch)?|[мМ][аА][рР](?:[тТ][аА]?)?/i, '03').
      gsub(/apr(?:il)?|[аА][пП][рР](?:[еЕ][лЛ][яЯьЬ]?)?/i, '04').
      gsub(/may|[мМ][аА][яЯйЙ]/i, '05').
      gsub(/june?|[иИ][юЮ][нН][яЯьЬ]?/i, '06').
      gsub(/july?|[иИ][юЮ][лЛ][яЯьЬ]?/i, '07').
      gsub(/aug(?:ust)?|[аА][вВ][гГ](?:[уУ][сС][тТ][аА]?)?/i, '08').
      gsub(/sep(?:tember)?|[сС][еЕ][нН](?:[тТ][яЯ][бБ][рР][яЯьЬ]?)?/i, '09').
      gsub(/oct(?:ober)?|[оО][кК][тТ](?:[яЯ][бБ][рР][яЯьЬ]?)?/i, '10').
      gsub(/nov(?:ember)?|[нН][оО][яЯ](?:[бБ][рР][яЯьЬ]?)?/i, '11').
      gsub(/dec(?:ember)?|[дД][еЕ][кК](?:[аА][бБ][рР][яЯьЬ]?)?/i, '12')
    end
    
    def tr_date
      gsub(/[яЯ][нН][вВ](?:[аА][рР][яЯьЬ]?)?/, 'jan').
      gsub(/[фФ][еЕ][вВ](?:[рР][аА][лЛ][яЯьЬ]?)?/, 'feb').
      gsub(/[мМ][аА][рР](?:[тТ][аА]?)?/, 'mar').
      gsub(/[аА][пП][рР](?:[еЕ][лЛ][яЯьЬ]?)?/, 'apr').
      gsub(/[мМ][аА][яЯйЙ]?/, 'may').
      gsub(/[иИ][юЮ][нН][яЯьЬ]?/, 'jun').
      gsub(/[иИ][юЮ][лЛ][яЯьЬ]?/, 'jul').
      gsub(/[аА][вВ][гГ](?:[уУ][сС][тТ][аА]?)?/, 'aug').
      gsub(/[сС][еЕ][нН](?:[тТ][яЯ][бБ][рР][яЯьЬ]?)?/, 'sep').
      gsub(/[оО][кК][тТ](?:[яЯ][бБ][рР][яЯьЬ]?)?/, 'oct').
      gsub(/[нН][оО][яЯ](?:[бБ][рР][яЯьЬ]?)?/, 'nov').
      gsub(/[дД][еЕ][кК](?:[аА][бБ][рР][яЯьЬ]?)?/, 'dec')
    end
    
    def digit_nums
      gsub(/[оО][дД][иИ][нН]|[еЕ][дД][иИ][нН][иИ][цЦ][аА]/, '1').
      gsub(/[дД][вВ](?:[оО][йЙ][кК])?[аА]/, '2').
      gsub(/[тТ][рР](?:[иИ]|[оО][йЙ][кК][аА])/, '3').
      gsub(/[чЧ][еЕ][тТ](?:[ыЫ][рР][еЕ]|[вВ][еЕёЁ][рР][кК][аА])/, '4').
      gsub(/[пП][яЯ][тТ](?:[ьЬ]|[еЕёЁ][рР][кК][аА])/, '5').
      gsub(/[шШ][еЕ][сС][тТ](?:[ьЬ]|[еЕёЁ][рР][кК][аА])/, '6').
      gsub(/[сС][еЕ][мМ](?:[ьЬ]|[еЕёЁ][рР][кК][аА])/, '7').
      gsub(/[вВ][оО][сС](?:[еЕ][мМ][ьЬ]|[ьЬ][мМ][еЕёЁ][рР][кК][аА])/i, '8').
      gsub(/[дД][еЕ][вВ][яЯ][тТ](?:[ьЬ]|[кК][аА])/, '9').
      gsub(/[нН][оОуУ][лЛ][ьЬ]/, '0')
    end
    
  else
  
    def digit_date
      gsub(/jan(?:uary)?|янв(?:ар[яь])?/i, '01').
      gsub(/feb(?:ruary)?|фев(?:рал[яь])?/i, '02').
      gsub(/mar(?:ch)?|март?а?/i, '03').
      gsub(/apr(?:il)?|апр(?:ел[яь])?/i, '04').
      gsub(/may|ма[яй]/i, '05').
      gsub(/june?|июн[яь]?/i, '06').
      gsub(/july?|июл[яь]?/i, '07').
      gsub(/aug(?:ust)?|авг(?:уста?)?/i, '08').
      gsub(/sep(?:tember)?|сен(?:тябр[яь])?/i, '09').
      gsub(/oct(?:ober)?|окт(?:ябр[яь])?/i, '10').
      gsub(/nov(?:ember)?|ноя(?:бр[яь])?/i, '11').
      gsub(/dec(?:ember)?|дек(?:абр[яь])?/i, '12')
    end
    
    def tr_date
      gsub(/янв(?:ар[яь])?/i, 'jan').
      gsub(/фев(?:рал[яь])?/i, 'feb').
      gsub(/март?а?/i, 'mar').
      gsub(/апр(?:ел[яь])?/i, 'apr').
      gsub(/ма[яй]/i, 'may').
      gsub(/июн[яь]?/i, 'jun').
      gsub(/июл[яь]?/i, 'jul').
      gsub(/авг(?:уста?)?/i, 'aug').
      gsub(/сен(?:тябр[яь])?/i, 'sep').
      gsub(/окт(?:ябр[яь])?/i, 'oct').
      gsub(/ноя(?:бр[яь])?/i, 'nov').
      gsub(/дек(?:абр[яь])?/i, 'dec')
    end
    
    def digit_nums
      gsub(/один|единица/i, '1').
      gsub(/дв(?:ойк|а)/i, '2').
      gsub(/тр(и|ойка)/i, '3').
      gsub(/чет(?:ыре|в[её]рка)/i, '4').
      gsub(/пят(?:ь|[её]рка)/i, '5').
      gsub(/шест(?:ь|[её]рка)/, '6').
      gsub(/сем(?:ь|[её]рка)/i, '7').
      gsub(/вос(?:емь|ьм[её]рка)/i, '8').
      gsub(/девят(ь|ка)/i, '9').
      gsub(/н[оу]ль/i, '0')
    end
    
  end
  
  alias :digitize :digit_date
end