# encoding: utf-8
class String
  
    def digit_date
      gsub(/jan|[яЯ][нН][вВ]([аА][рР][яЯьЬ]?)?/i, '01').
      gsub(/feb|[фФ][еЕ][вВ]([рР][аА][лЛ][яЯьЬ]?)?/i, '02').
      gsub(/mar|[мМ][аА][рР]([тТ][аА]?)?/i, '03').
      gsub(/apr|[аА][пП][рР]([еЕ][лЛ][яЯьЬ]?)?/i, '04').
      gsub(/may|[мМ][аА][яЯйЙ]?/i, '05').
      gsub(/june?|[иИ][юЮ][нН][яЯьЬ]?/i, '06').
      gsub(/july?|[иИ][юЮ][лЛ][яЯьЬ]?/i, '07').
      gsub(/aug|[аА][вВ][гГ]([уУ][сС][тТ][аА]?)?/i, '08').
      gsub(/sep|[сС][еЕ][нН]([тТ][яЯ][бБ][рР][яЯьЬ]?)?/i, '09').
      gsub(/oct|[оО][кК][тТ]([яЯ][бБ][рР][яЯьЬ]?)?/i, '10').
      gsub(/nov|[нН][оО][яЯ]([бБ][рР][яЯьЬ]?)?/i, '11').
      gsub(/dec|[дД][еЕ][кК]([аА][бБ][рР][яЯьЬ]?)?/i, '12')
    end
    alias :digitize :digit_date
    
    def tr_date
      gsub(/[яЯ][нН][вВ]([аА][рР][яЯьЬ]?)?/, 'jan').
      gsub(/[фФ][еЕ][вВ]([рР][аА][лЛ][яЯьЬ]?)?/, 'feb').
      gsub(/[мМ][аА][рР]([тТ][аА]?)?/, 'mar').
      gsub(/[аА][пП][рР]([еЕ][лЛ][яЯьЬ]?)?/, 'apr').
      gsub(/[мМ][аА][яЯйЙ]?/, 'may').
      gsub(/[иИ][юЮ][нН][яЯьЬ]?/, 'jun').
      gsub(/[иИ][юЮ][лЛ][яЯьЬ]?/, 'jul').
      gsub(/[аА][вВ][гГ]([уУ][сС][тТ][аА]?)?/, 'aug').
      gsub(/[сС][еЕ][нН]([тТ][яЯ][бБ][рР][яЯьЬ]?)?/, 'sep').
      gsub(/[оО][кК][тТ]([яЯ][бБ][рР][яЯьЬ]?)?/, 'oct').
      gsub(/[нН][оО][яЯ]([бБ][рР][яЯьЬ]?)?/, 'nov').
      gsub(/[дД][еЕ][кК]([аА][бБ][рР][яЯьЬ]?)?/, 'dec')
    end
    
    def digit_nums
      gsub(/[оО][дД][иИ][нН]|[еЕ][дД][иИ][нН][иИ][цЦ][аА]/, '1').
      gsub(/[дД][вВ]([оО][йЙ][кК])?[аА]/, '2').
      gsub(/[тТ][рР]([иИ]|[оО][йЙ][кК][аА])/, '3').
      gsub(/[чЧ][еЕ][тТ]([ыЫ][рР][еЕ]|[вВ][еЕёЁ][рР][кК][аА])/, '4').
      gsub(/[пП][яЯ][тТ]([ьЬ]|[еЕёЁ][рР][кК][аА])/, '5').
      gsub(/[шШ][еЕ][сС][тТ]([ьЬ]|[еЕёЁ][рР][кК][аА])/, '6').
      gsub(/[сС][еЕ][мМ]([ьЬ]|[еЕёЁ][рР][кК][аА])/, '7').
      gsub(/[вВ][оО][сС]([еЕ][мМ][ьЬ]|[ьЬ][мМ][еЕёЁ][рР][кК][аА])/i, '8').
      gsub(/[дД][еЕ][вВ][яЯ][тТ]([ьЬ]|[кК][аА])/, '9').
      gsub(/[нН][оОуУ][лЛ][ьЬ]/, '0')
    end

end